---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ConduitSettings.RiseDropAnnotationSize
source: html/a20d9956-bd18-dc27-37cb-7480b224847f.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings.RiseDropAnnotationSize Property

The rise drop annotation size.

## Syntax (C#)
```csharp
public double RiseDropAnnotationSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for riseDropAnnotationSize must be between 0 and 30000 feet.